HMEAYC/NSTC/firmware/sdkconfig.defaults
# ESP32-C3 target
CONFIG_IDF_TARGET="esp32c3"

# Flash size (ESP32-C3 SuperMini has 4MB)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Custom OTA partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Enable OTA support
CONFIG_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DOWN_MODE=y

# Enable HTTPS for OTA (GitHub Pages)
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_TLS_ENABLED=y

# Enable app update via OTA
CONFIG_HTTPD_WS_SUPPORT=n

# mDNS for hostname resolution (no more hardcoded IPs)
# lwip's CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES is already default y

# WiFi credentials (configure via NVS or override at build time)
CONFIG_HMEAYC_WIFI_SSID=""
CONFIG_HMEAYC_WIFI_PASSWORD=""

# Firmware version
CONFIG_HMEAYC_FIRMWARE_VERSION="1.0.0"

# Server endpoints (configure at build time or via NVS)
CONFIG_HMEAYC_WS_URI="ws://192.168.0.129:8000/ws/default"
CONFIG_HMEAYC_API_BASE_URL="http://192.168.0.129:8000/api"

# OTA endpoint (GitHub Pages)
CONFIG_HMEAYC_OTA_BASE_URL="https://HMEAYC.github.io/NSTC/ota"
